IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.

DATA DIVISION.
WORKING-STORAGE SECTION.
01  A   PIC 99V99 	VALUE 10.11.
01  B   PIC 99V99 	VALUE 20.22.
01  C   PIC 99V99 	VALUE 00.00.
01  D   PIC 999V99 	VALUE 00.00.
01 	CMP	PIC S9(5)V99	USAGE COMP	VALUE 04199.04.

PROCEDURE DIVISION.

ADD A TO B GIVING C.
DISPLAY C.

SUBTRACT A FROM B GIVING C ROUNDED.

DISPLAY C.
DISPLAY B.

ADD A TO B GIVING D.

DISPLAY D.

MULTIPLY A BY CMP.

DISPLAY CMP.

STOP RUN.
