IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.

DATA DIVISION.
WORKING-STORAGE SECTION.
01  A   PIC 99V99 	VALUE 10.11.
01  B   PIC 99V99 	VALUE 20.22.
01  C   PIC 99V99 	VALUE 00.00.
01  D   PIC $ZZZZV99 	VALUE 00.00.
01  ST  PIC $*(5).99 	VALUE 00.00.
01 	CMP	PIC S9(5)V99	USAGE COMP	VALUE 04199.04.
01	NOW	PIC 99/99/9(4)	VALUE 04102034.

PROCEDURE DIVISION.

ADD A TO B GIVING C.
DISPLAY "C: " C.

SUBTRACT A FROM B GIVING C ROUNDED.
DISPLAY "C: " C.
DISPLAY "B: " B.

ADD A TO B GIVING D.
DISPLAY "D: " D.

MULTIPLY A BY CMP.
DISPLAY "CMP: " CMP.

DIVIDE CMP BY 20 GIVING ST.
DISPLAY "ST: " ST.

DISPLAY "Date: " NOW.

STOP RUN.
